app/controllers/events_controller.rb

SELECT DISTINCT users.first_name, users.last_name, events.name, events.description, events.start_date, events.end_date, events.created_at, events.id FROM `events` INNER JOIN `attendings` ON `attendings`.`event_id` = `events`.`id` INNER JOIN `users` ON `users`.`id` = `events`.`created_by` WHERE `attendings`.`user_id` IS NULL
---
  def index
    @events = Event.joins(:attending, :user).select('users.first_name', 'users.last_name', 'events.name', 'events.description','events.start_date','events.end_date','events.created_at', 'events.id').where('attendings.user_id' => session[:user_id]).distinct

SELECT  `events`.* FROM `events` WHERE `events`.`id` = 0 LIMIT 1
SELECT attendings.id FROM `attendings` WHERE `attendings`.`user_id` = 1 AND `attendings`.`event_id` = 77
SELECT users.id, users.first_name, users.last_name, users.email FROM `attendings` INNER JOIN `users` ON `users`.`id` = `attendings`.`user_id` WHERE `attendings`.`event_id` = 2
---
  def show
    @event = Event.find(params[:id])
    @this_event_id = params[:id]
    @this_user_id = 1
    @is_this_user_attending = Attending.select('attendings.id').where('attendings.user_id' => @this_user_id, 'attendings.event_id' => @this_event_id)
    @attendees = Attending.joins(:user).select('users.id', 'users.first_name', 'users.last_name', 'users.email').where('attendings.event_id' => params[:id])

INSERT INTO `events` (`name`, `description`, `created_by`, `start_date`, `end_date`, `created_at`, `updated_at`) VALUES ('test', 'test', 1, '2016-05-01', '2016-05-01', '2016-05-01 14:54:16', '2016-05-01 14:54:16')
INSERT INTO `attendings` (`event_id`, `user_id`, `created_at`, `updated_at`) VALUES (2, 1, '2016-05-01 15:05:15', '2016-05-01 15:05:15')
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
        format.html { redirect_to @event, notice: 'Event was successfully created.' }
        format.json { render :show, status: :created, location: @event }
        @attending = Attending.new
        @attending.event_id = @event.id
        @attending.user_id = session[:user_id]
        @attending.save

UPDATE `events` SET `name` = 'test2', `created_by` = NULL, `updated_at` = '2016-05-01 15:43:02' WHERE `events`.`id` = 2
---
  def update
    respond_to do |format|
      if @event.update(event_params)

INSERT INTO `attendings` (`event_id`, `user_id`, `created_at`, `updated_at`) VALUES (2, 1, '2016-05-01 19:05:45', '2016-05-01 19:05:45')
---
  def attend
    @attending = Attending.new
    @attending.event_id = params[:id]
    @attending.user_id = session[:user_id]
    @attending.save

DELETE FROM `attendings` WHERE `attendings`.`id` = 1
SELECT  `attendings`.* FROM `attendings` WHERE `attendings`.`user_id` = 1 AND `attendings`.`event_id` = 2 LIMIT 1
---
  def unattend
    @unattending = Attending.find_by(user_id: session[:user_id], event_id: params[:id]).destroy