app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)


      if @user.save
---
INSERT INTO `users` (`email`, `password_digest`, `first_name`, `last_name`, `created_at`, `updated_at`) VALUES ('jefferson.neel@gmail.com', '$2a$10$vCXcxu.gpj.S7U1deObCFeiM9qqleiJ6XASzqULmnwEDgXPqJV/26', 'Jefferson', 'Neel', '2016-05-03 21:33:38', '2016-05-03 21:33:38')